### Gravando arquivos no Jupyter Notebook

In [2]:
# É importante frisar que esse modelo de gravação de arquivos vale somente no Jupyter (por conta do seu suporte) 
# ainda sem utilizar a biblioteca pandas na maipulação do dataset.

In [3]:
%%writefile arquivos/arquivo002.txt
Escrevendo mais uma linha no arquivo dois
Escrevendo mais uma linha no arquivo dois
Escrevendo mais uma linha no arquvio dois

Overwriting arquivos/arquivo002.txt

In [4]:
arq01 = open("arquivos/arquivo002.txt","r")

In [5]:
arq01.read()

'Escrevendo mais uma linha no arquivo dois\nEscrevendo mais uma linha no arquivo dois\nEscrevendo mais uma linha no arquvio dois\n'

In [6]:
arq01.seek(0,0)

0

In [7]:
arq01.seek(0)
arq01.readlines()

['Escrevendo mais uma linha no arquivo dois\n',
 'Escrevendo mais uma linha no arquivo dois\n',
 'Escrevendo mais uma linha no arquvio dois\n']

In [9]:
# Ou podemos utilizar o loop for para ler todo o aquivo
for linhas in open("arquivos/arquivo002.txt"):
    print(linhas)

Escrevendo mais uma linha no arquivo dois

Escrevendo mais uma linha no arquivo dois

Escrevendo mais uma linha no arquvio dois

In [10]:
arq01.close()

### Utilizando a biblioteca Pandas para manipular os arquivos

In [13]:
import pandas as pd
arquivo_atual = "datasets/binary.csv"

In [14]:
df_binary = pd.read_csv(arquivo_atual)

In [18]:
df_binary.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  880  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [20]:
arquivo_novo = "datasets/salarios.csv"
df_salarios = pd.read_csv(arquivo_novo)

In [22]:
df_salarios.head(10)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88968.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
5,"ABARCA, ANABEL",ASST TO THE ALDERMAN,CITY COUNCIL,$70764.00
6,"ABARCA, EMMANUEL",GENERAL LABORER - DSS,STREETS & SAN,$40560.00
7,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,$91520.00
8,"ABBATEMARCO, JAMES J",FIRE ENGINEER,FIRE,$90456.00
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,$86520.00